"""Common response structures and general messages."""

GENERAL = {
    'intro': 'היי! 👋 אני העוזר הדיגיטלי של Space & Order 🤖\nאשמח לעזור לך למצוא את השירות המתאים ולענות על כל שאלה.\nלנוחותך, בכל שלב ניתן לחזור לתפריט הראשי או לשוחח עם נציג/ה באמצעות הכפתורים בתחתית. 💬',
    'header': 'ברוכים הבאים לחוויית Space & Order ✨',
    'welcome_message': 'כדי שנוכל להתאים עבורך את השירות המושלם, אנא בחר/י את התחום המעניין אותך:',
    'footer': '',
    'options': [
        'מעבר דירה 🏠',
        'סידור וארגון הבית ✨',
        'שיחה עם נציג/ה 👩‍💼'
    ],
    'error': 'מצטערים, לא הצלחנו להבין את ההודעה. האם תוכל/י לנסח אותה מחדש?'
}

HUMAN_SUPPORT = {
    'transfer_message': 'תודה על פנייתך! נציג/ה מהצוות שלנו יחזור אליך בהקדם. 👋'
}

SCHEDULING = {
    'header': 'תיאום פגישה 📅',
    'title': 'איזה מועד נוח לך?',
    'footer': '',
}

NAVIGATION = {
    'back_to_main': 'חזרה לתפריט הראשי ⬅️',
    'talk_to_representative': 'שיחה עם נציג/ה 👩‍💼'
}